Repository: Mondei1/QRVault
Catalog: lib/l10n/app_*.arb
Languages: de

source: Settings
de: Einstellungen

source: Create
de: Erstellen

source: Welcome
de: Willkommen

# welcomeDescription
source: QRVault allows you to store password on the safest offline medium known: Paper ðŸ“ƒ
de: QRVault ermöglicht es dir, Ihr Passwort auf dem sichersten Offline-Medium zu speichern, das es gibt: Papier 📃.

source: Offline storage
de: Offline Speicher

# offlineStorageDescription
source: Printed QR codes cannot be hacked. They are also protected against other people scanning them thanks to encryption.
de: Gedruckte QR-Codes können nicht angegriffen werden. Dank der Verschlüsselung sind sie auch vor dem Scannen durch andere Personen geschützt.

source: Security
de: Sicherheit

# securityDescription
source: Everything on your QR code is encrypted. However, there are a few exceptions:
de: Alles auf Ihrem QR-Code ist verschlüsselt. Es gibt jedoch einige Ausnahmen:

# titleUnencrypted
source: Your title is unencrypted.
de: Ihr Titel ist unverschlüsselt.

# passwordHintUnencrypted
source: Your password hint is unencrypted.
de: Ihr Passworthinweis ist unverschlüsselt.

# encryptionInfo
source: QRVault uses industry-standard AES-256 encryption and Argon2id hashing.
de: QRVault verwendet AES-256-Verschlüsselung und Argon2id-Hashing nach Industriestandard.

# errorInitializingCamera
source: Error initializing camera: {error}
de: Fehler bei der Kamerainitialisierung: {error}

# languageChanged
source: Language changed. Please restart the app for the changes to take effect.
de: Sprache geändert. Bitte starten Sie die App neu, damit die Änderungen wirksam werden.

source: System Default
de: Systemstandard

# useSystemLanguage
source: Use the system language settings
de: Verwenden Sie die Spracheinstellungen des Systems

# englishLanguage
source: English
de: Englisch

# germanLanguage
source: German
de: Deutsch

source: Master Password
de: Master-Passwort

source: Biometrics
de: Biometrie

# biometricsInfo
source: You can use biometrics to protect your main password and make it easier to use.
de: Du kannst biometrische Daten verwenden, um dein Hauptpasswort zu schützen und die Nutzung zu erleichtern.

# biometricsSupport
source: Your phone supports biometric authentication, which is great! You can use it to set a master password to speed up the creation and scanning process.
de: Dein Gerät unterstützt die Authentifizierung mit Biometrie, das ist großartig! Du kannst sie als Master Passwort verwenden und so den Prozess der Verschlüsselung beschleunigen!

# passwordRequirements
source: QRVault does not enforce password requirements â€“ it is your responsibility.
de: QRVault stellt keine Anforderungen an dein Passwort – die Verantwortung liegt bei dir.

# passwordHint
source: Hint!
de: Hinweis für das Passwort

source: Stored Unencrypted
de: Unverschlüsselt gespeichert

# reinstallationInfo
source: If you have reinstalled this app, you should use the same master password that you used before. You can always enter manually too.
de: Wenn du diese App erneut installiert hast, solltest du dasselbe Master-Passwort wie zuvor verwenden. Du kannst es auch jederzeit manuell eingeben.

source: Use Biometrics
de: Biometrie verwenden

# biometricError
source: Your master password couldn't be used.
de: Dein Master-Passwort konnte nicht verwendet werden.

source: Skip
de: Überspringen

# loading
source: Let us do some cryptography and we'll right back!
de: Wir verschlüsseln alles und sind gleich wieder zurück!

source: Hold up
de: Einen Moment

source: Password
de: Passwort

source: Unlock this password
de: Entsperre dieses Passwort

# unlockNamedPassword
source: Unlock {passwordName}
de: Entsperre {passwordName}

# unlockWithPasswordButton
source: Unlock using password
de: Entsperren mit Password

# orDividerText
source: Or
de: Oder

# useBiometricsButton
source: Use biometrics
de: Nutze Biometrie

# usernameLabel
source: Username
de: Nutzername

# copyUsernameTooltip
source: Copy Username
de: Kopiere Nutzername

# copyEmailTooltip
source: Copy Email
de: Kopiere Email

# copyPasswordTooltip
source: Copy Password
de: Kopiere Passwort

source: Copied to clipboard!
de: Zur Zwischenablage hinzugefügt!

# previousOtpLabelPrefix
source: Prev:
de: Vorh.:

# nextOtpLabelPrefix
source: Next:
de: Näch.:

# scannedScreenTitle
source: Scanned Details
de: Entschlüsselte Daten

source: Length
de: Länge

source: Include
de: Zeichenauswahl

source: Use this
de: Verwenden

# errorNoCharTypesSelected
source: Select at least one char type
de: Wähle mindestens einen Zeichentyp aus

# generatePasswordTooltip
source: Generate password
de: Passwort generieren

# setPasswordAppBarTitle
source: Password
de: Passwort

# setPasswordHeadline
source: Set password
de: Passwort festlegen

# setPasswordDescription
source: Set the encryption password manually to protect this QR code.
de: Legen Sie das Verschlüsselungspasswort manuell fest, um diesen QR-Code zu schützen.

# passwordFieldLabel
source: Password
de: Passwort

# hintFieldLabel
source: Hint
de: Hinweis

# usePasswordButton
source: Use password
de: Passwort verwenden

# createQrCodeAppBarTitle
source: Create QR-Code
de: QR-Code erstellen

# titleFieldLabel
source: Title
de: Titel

# titleFieldHint
source: Title
de: Titel

# titleFieldDescription
source: Printed as a headline on the paper and plain inside the QR code.
de: Wird als Überschrift auf dem Papier und unverschlüsselt im QR-Code gedruckt.

# usernameFieldHint
source: Username
de: Benutzername

# passwordFieldHint
source: Secure Password
de: Sicheres Passwort

# totpSecretFieldLabel
source: TOTP Secret
de: TOTP-Geheimnis

# totpSecretFieldHint
source: 32 byte secret
de: 32-Byte-Geheimnis

# generateButtonLabel
source: Generate
de: Generieren

# notesFieldLabel
source: Notes
de: Notizen

# notesFieldHint
source: Notes
de: Notizen

source: Home
de: Startseite

source: QR Code Printing
de: QR-Code-Drucken

# qrCodePrintingError
source: Error generating QR code for printing
de: Fehler beim Generieren des QR-Codes zum Drucken

# qrCodeGeneratedBy
source: Generated by QRVault
de: Erstellt mit QRVault

# qrCodeHint
source: Hint: {hint}
de: Hinweis: {hint}

# unlockScreenTitle
source: Unlock {title}
de: {title} entsperren

# enterPasswordMessage
source: Please enter a password
de: Bitte geben Sie ein Passwort ein

# decryptionFailedMessage
source: Decryption failed: You have entered an invalid password!
de: Entschlüsselung fehlgeschlagen: Sie haben ein ungültiges Passwort eingegeben!

# unlockButton
source: Unlock
de: Entsperren

# passwordHintText
source: Hint: {hint}
de: Hinweis: {hint}

# biometricsNotImplementedMessage
source: Biometrics not implemented yet
de: Biometrie noch nicht implementiert

# invalidUri
source: This QR-Code was not generated by QRVault!
de: Dieser QR-Code wurde nicht von QRVault erstellt!

# providePassword
source: Please insert a password!
de: Bitte gebe ein Passwort ein!
